{"code":200,"status":"OK","data":[{"number":63,"name":"سورة المنافقون","englishName":"Al-Munaafiqoon","englishNameTranslation":"The Hypocrites","revelationType":"Medinan","numberOfAyahs":11,"ayahs":[{"number":5189,"text":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ إِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ ۗ وَاللَّهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُ وَاللَّهُ يَشْهَدُ إِنَّ الْمُنَافِقِينَ لَكَاذِبُونَ","numberInSurah":1,"juz":28},{"text":"الم"},{"number":5190,"text":"اتَّخَذُوا أَيْمَانَهُمْ جُنَّةً فَصَدُّوا عَنْ سَبِيلِ اللَّهِ ۚ إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ","numberInSurah":2,"juz":28},{"number":5191,"text":"ذَٰلِكَ بِأَنَّهُمْ آمَنُوا ثُمَّ كَفَرُوا فَطُبِعَ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَفْقَهُونَ","numberInSurah":3,"juz":28},{"number":5192,"text":"۞ وَإِذَا رَأَيْتَهُمْ تُعْجِبُكَ أَجْسَامُهُمْ ۖ وَإِنْ يَقُولُوا تَسْمَعْ لِقَوْلِهِمْ ۖ كَأَنَّهُمْ خُشُبٌ مُسَنَّدَةٌ ۖ يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ ۚ هُمُ الْعَدُوُّ فَاحْذَرْهُمْ ۚ قَاتَلَهُمُ اللَّهُ ۖ أَنَّىٰ يُؤْفَكُونَ","numberInSurah":4,"juz":28},{"number":5193,"text":"وَإِذَا قِيلَ لَهُمْ تَعَالَوْا يَسْتَغْفِرْ لَكُمْ رَسُولُ اللَّهِ لَوَّوْا رُءُوسَهُمْ وَرَأَيْتَهُمْ يَصُدُّونَ وَهُمْ مُسْتَكْبِرُونَ","numberInSurah":5,"juz":28},{"number":5194,"text":"سَوَاءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ لَنْ يَغْفِرَ اللَّهُ لَهُمْ ۚ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ","numberInSurah":6,"juz":28},{"number":5195,"text":"هُمُ الَّذِينَ يَقُولُونَ لَا تُنْفِقُوا عَلَىٰ مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّىٰ يَنْفَضُّوا ۗ وَلِلَّهِ خَزَائِنُ السَّمَاوَاتِ وَالْأَرْضِ وَلَٰكِنَّ الْمُنَافِقِينَ لَا يَفْقَهُونَ","numberInSurah":7,"juz":28},{"number":5196,"text":"يَقُولُونَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ ۚ وَلِلَّهِ الْعِزَّةُ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ وَلَٰكِنَّ الْمُنَافِقِينَ لَا يَعْلَمُونَ","numberInSurah":8,"juz":28},{"number":5197,"text":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُلْهِكُمْ أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ عَنْ ذِكْرِ اللَّهِ ۚ وَمَنْ يَفْعَلْ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْخَاسِرُونَ","numberInSurah":9,"juz":28},{"number":5198,"text":"وَأَنْفِقُوا مِنْ مَا رَزَقْنَاكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَ أَحَدَكُمُ الْمَوْتُ فَيَقُولَ رَبِّ لَوْلَا أَخَّرْتَنِي إِلَىٰ أَجَلٍ قَرِيبٍ فَأَصَّدَّقَ وَأَكُنْ مِنَ الصَّالِحِينَ","numberInSurah":10,"juz":28},{"number":5199,"text":"وَلَنْ يُؤَخِّرَ اللَّهُ نَفْسًا إِذَا جَاءَ أَجَلُهَا ۚ وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ","numberInSurah":11,"juz":28}],"edition":{"identifier":"quran-simple","language":"ar","name":"Simple","englishName":"Simple","format":"text","type":"quran"}},{"number":63,"name":"سورة المنافقون","englishName":"Al-Munaafiqoon","englishNameTranslation":"The Hypocrites","revelationType":"Medinan","numberOfAyahs":11,"ayahs":[{"text":"In the name of God, The Most Gracious, The Dispenser of Grace:"},{"number":5189,"text":"WHEN THE HYPOCRITES come unto thee, they say, \"We bear witness that thou art indeed God's Apostle!\" But God knows that thou art truly His Apostle; and He bears witness that the hypocrites are indeed false [in their declaration of faith].","numberInSurah":1,"juz":28},{"number":5190,"text":"They have made their oaths a cover [for their falseness], and thus they turn others away from the Path of God. Evil indeed is all that they are wont to do:","numberInSurah":2,"juz":28},{"number":5191,"text":"this, because [they profess that] they have attained to faith, whereas [inwardly] they deny the truth - and so, a seal has been set on their hearts so that they can no longer understand [what is true and what false].","numberInSurah":3,"juz":28},{"number":5192,"text":"Now when thou seest them, their outward appearance may please thee; and when they speak, thou art inclined to lend ear to what they say. [But though they may seem as sure of themselves] as if they were timbers [firmly] propped up, they think that every shout is [directed] against them. They are the [real] enemies [of all faith], so beware of them. [They deserve the imprecation,] \"May God destroy them!\" How perverted are their minds!","numberInSurah":4,"juz":28},{"number":5193,"text":"for, when they are told, \"Come, the Apostle of God will pray [unto God] that you be forgiven\", they turn their heads away, and thou canst see how they draw back in their false pride.","numberInSurah":5,"juz":28},{"number":5194,"text":"As for them it is all the same whether thou dost pray that they be forgiven or dost not pray for them: God will nor forgive them - for, behold, God does not bestow His guidance upon such iniquitous folk.","numberInSurah":6,"juz":28},{"number":5195,"text":"It is they who say [to their compatriots], \"Do not spend anything on those who are with God's Apostle, so that they [may be forced to] leave.\" However, unto God belong the treasures of the heavens and the earth: but this truth the hypocrites cannot grasp.","numberInSurah":7,"juz":28},{"number":5196,"text":"[And] they say, \"Indeed, when we return to the City [we,] the ones most worthy of honour will surely drive out therefrom those most contemptible ones!\" However, all honour belongs to God, and [thus] to His Apostle and those who believe [in God]: but of this the hypocrites are not aware.","numberInSurah":8,"juz":28},{"number":5197,"text":"O YOU who have attained to faith! Let not your worldly goods or your children make you oblivious of the remembrance of God: for If any behave thus - it is they, they who are the losers!","numberInSurah":9,"juz":28},{"number":5198,"text":"And spend on others out of what We have provided for you as sustenance, ere there come a time when death approaches any of you, and he then says, \"O my Sustainer! If only Thou wouldst grant me a delay for a short while, so that I could give in charity and be among the righteous!\"","numberInSurah":10,"juz":28},{"number":5199,"text":"But never does God grant a delay to a human being when his term has come; and God is fully aware of all that you do.","numberInSurah":11,"juz":28}],"edition":{"identifier":"en.asad","language":"en","name":"Asad","englishName":"Muhammad Asad","format":"text","type":"translation"}}]}