{"code":200,"status":"OK","data":[{"number":64,"name":"سورة التغابن","englishName":"At-Taghaabun","englishNameTranslation":"Mutual Disillusion","revelationType":"Medinan","numberOfAyahs":18,"ayahs":[{"number":5200,"text":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","numberInSurah":1,"juz":28},{"text":"الم"},{"number":5201,"text":"هُوَ الَّذِي خَلَقَكُمْ فَمِنْكُمْ كَافِرٌ وَمِنْكُمْ مُؤْمِنٌ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ","numberInSurah":2,"juz":28},{"number":5202,"text":"خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ ۖ وَإِلَيْهِ الْمَصِيرُ","numberInSurah":3,"juz":28},{"number":5203,"text":"يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ ۚ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","numberInSurah":4,"juz":28},{"number":5204,"text":"أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ كَفَرُوا مِنْ قَبْلُ فَذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ","numberInSurah":5,"juz":28},{"number":5205,"text":"ذَٰلِكَ بِأَنَّهُ كَانَتْ تَأْتِيهِمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَقَالُوا أَبَشَرٌ يَهْدُونَنَا فَكَفَرُوا وَتَوَلَّوْا ۚ وَاسْتَغْنَى اللَّهُ ۚ وَاللَّهُ غَنِيٌّ حَمِيدٌ","numberInSurah":6,"juz":28},{"number":5206,"text":"زَعَمَ الَّذِينَ كَفَرُوا أَنْ لَنْ يُبْعَثُوا ۚ قُلْ بَلَىٰ وَرَبِّي لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ ۚ وَذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ","numberInSurah":7,"juz":28},{"number":5207,"text":"فَآمِنُوا بِاللَّهِ وَرَسُولِهِ وَالنُّورِ الَّذِي أَنْزَلْنَا ۚ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ","numberInSurah":8,"juz":28},{"number":5208,"text":"يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ۖ ذَٰلِكَ يَوْمُ التَّغَابُنِ ۗ وَمَنْ يُؤْمِنْ بِاللَّهِ وَيَعْمَلْ صَالِحًا يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ","numberInSurah":9,"juz":28},{"number":5209,"text":"وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ النَّارِ خَالِدِينَ فِيهَا ۖ وَبِئْسَ الْمَصِيرُ","numberInSurah":10,"juz":28},{"number":5210,"text":"مَا أَصَابَ مِنْ مُصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ وَمَنْ يُؤْمِنْ بِاللَّهِ يَهْدِ قَلْبَهُ ۚ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","numberInSurah":11,"juz":28},{"number":5211,"text":"وَأَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ ۚ فَإِنْ تَوَلَّيْتُمْ فَإِنَّمَا عَلَىٰ رَسُولِنَا الْبَلَاغُ الْمُبِينُ","numberInSurah":12,"juz":28},{"number":5212,"text":"اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ","numberInSurah":13,"juz":28},{"number":5213,"text":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلَادِكُمْ عَدُوًّا لَكُمْ فَاحْذَرُوهُمْ ۚ وَإِنْ تَعْفُوا وَتَصْفَحُوا وَتَغْفِرُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ","numberInSurah":14,"juz":28},{"number":5214,"text":"إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ ۚ وَاللَّهُ عِنْدَهُ أَجْرٌ عَظِيمٌ","numberInSurah":15,"juz":28},{"number":5215,"text":"فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ وَاسْمَعُوا وَأَطِيعُوا وَأَنْفِقُوا خَيْرًا لِأَنْفُسِكُمْ ۗ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ","numberInSurah":16,"juz":28},{"number":5216,"text":"إِنْ تُقْرِضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ ۚ وَاللَّهُ شَكُورٌ حَلِيمٌ","numberInSurah":17,"juz":28},{"number":5217,"text":"عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيزُ الْحَكِيمُ","numberInSurah":18,"juz":28}],"edition":{"identifier":"quran-simple","language":"ar","name":"Simple","englishName":"Simple","format":"text","type":"quran"}},{"number":64,"name":"سورة التغابن","englishName":"At-Taghaabun","englishNameTranslation":"Mutual Disillusion","revelationType":"Medinan","numberOfAyahs":18,"ayahs":[{"text":"In the name of God, The Most Gracious, The Dispenser of Grace:"},{"number":5200,"text":"ALL THAT IS in the heavens and all that is on earth extols God's limitless glory: His is all dominion, and to Him all praise is due; and He has the power to will anything.","numberInSurah":1,"juz":28},{"number":5201,"text":"He it is who has created you: and among you are such as deny this truth, and among you are such as believe [in it]. And God sees all that you do.","numberInSurah":2,"juz":28},{"number":5202,"text":"He has created the heavens and the earth in accordance with [an inner] truth, and has formed you - and formed you so well; and with Him is your journey's end.","numberInSurah":3,"juz":28},{"number":5203,"text":"He knows all that is in the heavens and on earth; and He knows all that you keep secret as well as all that you bring into the open: for God has full knowledge of what is in the hearts [of men].","numberInSurah":4,"juz":28},{"number":5204,"text":"HAVE THE STORIES of those who, in earlier times, refused to acknowledge the truth never yet come within your ken? [They denied it -] and so they had to taste the evil outcome of their own doings, with [more] grievous suffering awaiting them [in the life to come]:","numberInSurah":5,"juz":28},{"number":5205,"text":"this, because time and again there came unto them their apostles with all evidence of the truth, but they [always] replied, \"Shall mere mortal men be our guides?\" And so they. denied the truth and turned away. But God was not in need [of them]: for God is self-sufficient, ever to be praised.","numberInSurah":6,"juz":28},{"number":5206,"text":"They who are bent on denying the truth claim that they will never be raised from the dead! Say: \"Yea, by my Sustainer! Most surely will you be raised from the dead, and then, most surely, will you be made to understand what you did [in life]! For, easy is this for God!\"","numberInSurah":7,"juz":28},{"number":5207,"text":"Believe then, [O men,] in God and His Apostle, and in the light [of revelation] which We have bestowed [on you] from on high! And God is fully aware of all that you do.","numberInSurah":8,"juz":28},{"number":5208,"text":"[Think of] the time when He shall gather you all together unto the Day of the [Last] Gathering - that Day of Loss and Gain! For, as for him who shall have believed in God and done what is just and right, He will [on that Day] efface his bad deeds, and will admit him into gardens through which running waters flow, therein to abide beyond the count of time: that will be a triumph supreme!","numberInSurah":9,"juz":28},{"number":5209,"text":"But as for those who are bent on denying the truth and on giving the lie to Our messages - they are destined for the fire, therein to abide: and how vile a journey’s end!","numberInSurah":10,"juz":28},{"number":5210,"text":"NO CALAMITY can ever befall [man] unless it be by God's leave: hence, whoever believes in God guides his [own] heart [towards this truth]; and God has full knowledge of everything.","numberInSurah":11,"juz":28},{"number":5211,"text":"Pay heed, then, unto God, and pay heed unto the Apostle; and if you turn away, [know that] Our Apostle's only duty is a clear delivery of this message:","numberInSurah":12,"juz":28},{"number":5212,"text":"God - there is no deity save Him! In God then let the believers place their trust.","numberInSurah":13,"juz":28},{"number":5213,"text":"O YOU who have attained to faith! Behold, some of your spouses and your children are enemies unto you: so beware of them! But if you pardon [their faults] and forbear, and forgive-then, behold, God will be much-forgiving, a dispenser of grace.","numberInSurah":14,"juz":28},{"number":5214,"text":"Your worldly goods and your children are but a trial and a temptation, whereas with God there is a tremendous reward.","numberInSurah":15,"juz":28},{"number":5215,"text":"Remain, then, conscious of God as best you can, and listen [to Him], and pay heed. And spend in charity for the good of your own selves: for, such as from their own covetousness are saved – it is they, they that shall attain to a happy state!","numberInSurah":16,"juz":28},{"number":5216,"text":"If you offer up to God a goodly loan, He will amply repay you for it, and will forgive you your sins: for God is ever responsive to gratitude, forbearing,","numberInSurah":17,"juz":28},{"number":5217,"text":"knowing all that is beyond the reach of a created being's perception as well as all that can be witnessed by a creature's senses or mind - the Almighty, the Wise!","numberInSurah":18,"juz":28}],"edition":{"identifier":"en.asad","language":"en","name":"Asad","englishName":"Muhammad Asad","format":"text","type":"translation"}}]}